In [28]:
import pandas as pd

# Series

In [3]:
data = [1,2,3,4,5]

In [4]:
s = pd.Series(data)

In [5]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
index = ['Linha' + str(i) for i in range(5)]

In [8]:
s = pd.Series(data)

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [9]:
s = pd.Series(data = data,index = index)

In [10]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [12]:
data ={'Linha' + str(i) : i + 1  for i in range(5)}

In [13]:
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [14]:
s = pd.Series(data)

In [15]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [16]:
s1 = s+2

In [17]:
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

# Data Frame

In [25]:
data=  [[1,2,3],
        [4,5,6],
        [7,8,9]]

In [26]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [30]:
df1 =pd.DataFrame(data = data)

In [31]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [32]:
index = ['Linha' + str(i) for i in range (3)]

In [33]:
index

['Linha0', 'Linha1', 'Linha2']

In [34]:
df1 =pd.DataFrame(data = data, index =index)

In [35]:
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [36]:
columns = ['coluna' + str(i) for i in range (3)]
columns

['coluna0', 'coluna1', 'coluna2']

In [70]:
df2 =pd.DataFrame(data = data, index =index, columns = columns)

In [38]:
df2

        coluna0  coluna1  coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [39]:
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [40]:
data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [41]:
data=  [(1,2,3),
        (4,5,6),
        (7,8,9)]

In [42]:
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [81]:
df3 = pd.DataFrame(data = data, index =index, columns = columns)

In [72]:
df3

        coluna0  coluna1  coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [78]:
df1[df1>0] = 'A'
df1

       coluna0 coluna1 coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [79]:
df2[df2>0] = 'B'
df2

       coluna0 coluna1 coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [82]:
df3[df3>0] = 'C'
df3

       coluna0 coluna1 coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [83]:
df4 = pd.concat([df1,df2,df3])

In [84]:
df4

       coluna0 coluna1 coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C